using System;

namespace SymWin
{
    public class CharacterConst
    {
        public static readonly char[] NEGATED_RELATIONS_CHARS =
        {
            '∉', '∌', '⊄', '⊅', '⊈', '⊊', '⊋', '⊉', '≮', '≯', '≰', '≱',
            '≢', '≁', '≄', '≉', '≇', '≭', '≨', '≩', '⊀', '⊁', '⋠', '⋡',
            '⋢', '⋣', '⋦', '⋧', '⋨', '⋩', '⋪', '⋫', '⋬', '⋭', '∤', '∦',
            '⊬', '⊭', '⊮', '⊯', '∄'
        };

        public static readonly char[] RELATIONS_CHARS =
        {
            '∀', '∃', '∈', '∋', '⊂', '⊃', '⊆', '⊇', '<', '>', '≤', '≥',
            '≡', '∼', '≃', '≈', '≅', '≍', '≪', '≺', '≻', '≼', '≽', '⊏', '⊐',
            '⊑', '⊒', '∥', '⊥', '⊢', '⊣', '⋈', '×', '∝', '∩', '∪', '⊎', '⊓',
            '⊔', '∧', '∨'
        };

        public static readonly char[] GREEK_LETTERS_LOWERCASE =
        {
            'α', 'β', 'γ', 'δ', 'ε', 'ζ', 'η', 'θ', 'κ', 'λ',
            'μ','ν','ξ','ο','π','ϖ','ρ', 'σ', 'τ', 'υ', 'φ', 'χ', 'ψ', 'ω'
        };

        public static readonly char[] GREEK_LETTERS_UPPERCASE =
        {
            'Α','Β','Γ','Δ','Ε','Ζ','Η','Θ','Ι','Κ','Λ','Μ',
            'Ν','Ξ','Ο','Π','Ρ','Σ','Τ','Υ','Φ','Χ','Ψ','Ω'
        };

        public static readonly char[] DOUBLE_STRUCK_CHARS =
        {
            'ℂ', 'ℕ', 'ℙ', 'ℚ', 'ℝ', 'ℤ'
        };

        public static readonly char[] ARROWS_CHARS_PART1 =
        {
            '←','→','↑','↓','↕','↔','↕','⇐','⇒','⇑','⇓','⇔','⇕','⟵',
            '⟶','⟷','⟸','⟹','⟺','↗','↖','↘','↙','⇠','⇢','↤','↦','⇚',
            '⇛','↞','↠','↶','↷','↺',
        };

        public static readonly char[] ARROWS_CHARS_PART2 =
        {
            '⟻','⟼','↩','↪','↼','↽','⇀','⇁','↿','↾','⇃','⇂','⇋','⇌',
            '⇇','⇉','⇈','⇊','⇆','⇄','↫','↬','↢','↣','↰','↱','↲','↳',
            '↻','⊸','↭','↜','↝','⇜'
        };

        public static readonly char[] NEGATED_ARROWS_CHARS =
        {
            '↚', '↛', '↮', '⇍', '⇏', '⇎'
        };

        public static readonly char[] GEOMETRY_CHARS =
        {
            '∟', '∠', '∡', '∢', '⊾', '⊿', '⋕', '⊥',
            '∤', '∥', '∦', '∶', '∷', '∴', '∵','∎'
        };


        public static readonly char[] BINARY_OPERATIONS =
        {
            '∔','∸','∖','⋒','⋓','⊟','⊠','⊡','⊞','⋇','⋉',
            '⋊','⋋','⋌','⋏','⋎','⊝','⊺','⊕','⊖','⊗','⊘',
            '⊙','⊛','⊚','†','‡','⋆','⋄','≀','△','⋀','⋁',
            '⨀','⨂','⨁','⨅','⨆','⨄','⨃',
        };

        public static readonly char[] ADVANCED_RELATIONAL_OPERATIONS =
        {
            '∴','∵','⋘','≧','≲','≳','⋖','⋗','≶','⋚','≷','⋛',
            '≑','≒','≓','∽','≊','⋍','≼','≽','⋞','⋟','≾','≿',
            '⋜','⋝','⊆','⊇','⊲','⊳','⊴','⊵','⊨','⋐','⋑','⊏',
            '⊐','⊩','⊪','≖','≗','≜','≏','≎','∝','≬','⋔','≐','⋈'
        };

        public static readonly char[] BASIC_MATH_PART1 =
        {
           '±','∞','=','≠','~','×','÷','!','∝','<','≪',
           '>','≫','≤','≥','∓','≅','≈','≡','∀','∁','∂',
            '√','∛','∜','∪','∩','∅','%','°','℉','℃','∆',
            '⋰','⋱','∎',' '
        };

        public static readonly char[] BASIC_MATH_PART2 =
       {
            '∇','∃','∄','∈','∋','←','↑','→','↓','↔',
            '∴','+','-','¬','α','β','γ','δ','ε','ϵ','θ',
            'ϑ','μ','π','ρ','σ','τ','φ','ω','*','∙','⋮',
            '⋯','⋰','⋱','ℵ','ℶ'
        };

        public static readonly char[] BASIC_N_ARRAY_OPERATORS =
        {
            '∑','∫','∬','∭','∮','∯','∰','∱','∲','∳',
            '∏','∐','⋂','⋃','⋀','⋁','⨀','⨂','⨄','⨃'
        };

        public static readonly Tuple<Char[], Char[]> EMPTY_TUPLE = Tuple.Create(new Char[0], new Char[0]);
    }
}
